{
    "version": "2.1.0",
    "url": "https://github.com/Andro2k/KickMonitor/releases/download/kickmonitorV2.1.0/KickMonitor_Setup_v2.1.0.exe",
    "changelog": "<h3>🚀 v2.1.0: Major Update & Architecture Overhaul</h3><p>Una actualización mayor que marca un antes y un después en la interactividad. Introduce un Motor de Alertas Dedicado, transforma la experiencia de usuario y resuelve errores críticos de conexión y bases de datos.</p><h4>✨ Nuevas Características</h4><ul><li><b>Nuevo Motor de Alertas para OBS:</b> Se ha implementado un AlertOverlayWorker independiente (puerto 6002) para alertas visuales de Seguidores, Subs y Hosts.</li><li><b>Entorno de Pruebas (Mock Data):</b> Botón 'Probar' en las alertas para inyectar datos simulados y visualizar la animación en OBS al instante.</li><li><b>Sincronización Bidireccional:</b> El servicio de chat y la tabla de puntos ahora están unificados. Silenciar en Puntos actualiza el Chat Overlay mágicamente.</li><li><b>Interfaz de Etiquetas (Tag Pills):</b> Nuevo sistema de tags interactivos impulsado por FlowLayout para los nombres de usuarios ignorados.</li></ul><h4>🐛 Correcciones de Errores</h4><ul><li><b>Resolución de Slugs (API de Kick):</b> Solucionado el error 404 al conectar canales con espacios o guiones bajos (ej. Andro_BOT). El sistema ahora sanitiza los nombres a Slugs válidos.</li><li><b>Parámetros Invertidos en Seguidores:</b> Corregido el MainController para mostrar el nombre real del seguidor en lugar del contador '1'.</li><li><b>Eliminación de Sesión OAuth:</b> 'Desvincular Cuenta' ahora destruye físicamente el archivo session.json para forzar un login limpio.</li><li><b>Supresión de Logs Fantasma:</b> La consola en vivo ahora ignora eventos nulos, eliminando saltos de línea vacíos.</li></ul><h4>⚙️ Mejoras Técnicas (Under the Hood)</h4><ul><li><b>Liberación de Bloqueos en SQLite:</b> El servicio de restauración ahora cierra explícitamente la conexión antes de sobrescribir el .db, eliminando PermissionErrors en Windows.</li><li><b>Arquitectura de Puertos Separados:</b> El Chat (6001) y las Alertas (6002) operan en puertos independientes para evitar colisiones WebSocket en OBS.</li></ul>"
}